print('''
1.木兰诗

唧唧复唧唧，木兰当户织。不闻机杼声，唯闻女叹息。

问女何所思，问女何所忆。女亦无所思，女亦无所忆。昨夜见军帖，可汗大点兵，军书十二卷，卷卷有爷名。阿爷无大儿，木兰无长兄，愿为市鞍马，从此替爷征。

东市买骏马，西市买鞍鞯，南市买辔头，北市买长鞭。旦辞爷娘去，暮宿黄河边，不闻爷娘唤女声，但闻黄河流水鸣溅溅。旦辞黄河去，暮至黑山头，不闻爷娘唤女声，但闻燕山胡骑鸣啾啾。

万里赴戎机，关山度若飞。朔气传金柝，寒光照铁衣。将军百战死，壮士十年归。

归来见天子，天子坐明堂。策勋十二转，赏赐百千强。可汗问所欲，木兰不用尚书郎，愿驰千里足，送儿还故乡。

爷娘闻女来，出郭相扶将；阿姊闻妹来，当户理红妆；小弟闻姊来，磨刀霍霍向猪羊。开我东阁门，坐我西阁床，脱我战时袍，著我旧时裳。当窗理云鬓，对镜贴花黄。出门看火伴，火伴皆惊忙：同行十二年，不知木兰是女郎。

雄兔脚扑朔，雌兔眼迷离；双兔傍地走，安能辨我是雄雌？''')
print()
print()
print()
print('''
2.孙权劝学

初，权谓吕蒙曰：“卿今当涂掌事，不可不学！”蒙辞以军中多务。权曰：“孤岂欲卿治经为博士邪！但当涉猎，见往事耳。卿言多务，孰若孤？孤常读书，自以为大有所益。”蒙乃始就学。及鲁肃过寻阳，与蒙论议，大惊曰：“卿今者才略，非复吴下阿蒙！”蒙曰：“士别三日，即更刮目相待，大兄何见事之晚乎！”肃遂拜蒙母，结友而别。''')
print()
print()
print()
print('''
3.春夜洛城闻笛

谁家玉笛暗飞声，

散入春风满洛城。

此夜曲中闻折柳，

何人不起故园情。''')
print()
print()
print()
print('''
4.陋室铭

山不在高，有仙则名。水不在深，有龙则灵。斯是陋室，惟吾德馨。苔痕上阶绿，草色入帘青。谈笑有鸿儒，往来无白丁。可以调素琴，阅金经。无丝竹之乱耳，无案牍之劳形。南阳诸葛庐，西蜀子云亭。孔子云：何陋之有？''')
print()
print()
print()
print('''
5.钗头凤·红酥手

红酥手，黄滕酒，满城春色宫墙柳。东风恶，欢情薄。一杯愁绪，几年离索。错，错，错！

春如旧，人空瘦，泪痕红浥鲛绡透。桃花落，闲池阁。山盟虽在，锦书难托。莫，莫，莫！''')
print()
print()
print()
print('''
6.钗头凤·世情薄

世情薄，人情恶，雨送黄昏花易落。晓风干，泪痕残。欲笺心事，独语斜阑。难，难，难！

人成各，今非昨，病魂常似秋千索。角声寒，夜阑珊。怕人寻问，咽泪装欢。瞒，瞒，瞒！''')
print()
print()
print()
print('''
7.爱莲说

水陆草木之花，可爱者甚蕃。晋陶渊明独爱菊。自李唐来，世人甚爱牡丹。予独爱莲之出淤泥而不染，濯清涟而不妖，中通外直，不蔓不枝，香远益清，亭亭净植，可远观而不可亵玩焉。

予谓菊，花之隐逸者也；牡丹，花之富贵者也；莲，花之君子者也。噫！菊之爱，陶后鲜有闻。莲之爱，同予者何人？牡丹之爱，宜乎众矣！
''')
print()
print()
print()
print('''
8.河中石兽

沧州南一寺临河干，山门圮于河，二石兽并沉焉。阅十余岁，僧募金重修，求石兽于水中，竟不可得。以为顺流下矣，棹数小舟，曳铁钯，寻十余里，无迹。

一讲学家设帐寺中，闻之笑曰：“尔辈不能究物理，是非木杮，岂能为暴涨携之去？乃石性坚重，沙性松浮，湮于沙上，渐沉渐深耳。沿河求之，不亦颠乎？”众服为确论。

一老河兵闻之，又笑曰：“凡河中失石，当求之于上流。盖石性坚重，沙性松浮，水不能冲石，其反激之力，必于石下迎水处啮沙为坎穴，渐激渐深，至石之半，石必倒掷坎穴中。如是再啮，石又再转。转转不已，遂反溯流逆上矣。求之下流，固颠；求之地中，不更颠乎？”如其言，果得于数里外。然则天下之事，但知其一，不知其二者多矣，可据理臆断欤？''')
print()
print()
print()
print('''
9.逢入京使

故园东望路漫漫，双袖龙钟泪不干。

马上相逢无纸笔，凭君传语报平安。''')
print()
print()
print()
print('''
10.八六子·倚危亭

倚危亭。恨如芳草，萋萋刬尽还生。念柳外青骢别后，水边红袂分时，怆然暗惊。

无端天与娉婷。夜月一帘幽梦，春风十里柔情。怎奈向、欢娱渐随流水，素弦声断，翠绡香减，那堪片片飞花弄晚，蒙蒙残雨笼晴。正销凝。黄鹂又啼数声。''')
print()
print()
print()
print('''
11.隔汉江寄子安

江南江北愁望，相思相忆空吟。

鸳鸯暖卧沙浦，鸂鶒闲飞橘林。

烟里歌声隐隐，渡头月色沈沈。

含情咫尺千里，况听家家远砧。''')
print()
print()
print()
print('''
12.浣纱庙

吴越相谋计策多，浣纱神女已相和。

一双笑靥才回面，十万精兵尽倒戈。

范蠡功成身隐遁，伍胥谏死国消磨。

只今诸暨长江畔，空有青山号苎萝。''')
print()
print()
print()
print('''
13.破阵子·为陈同甫赋壮词以寄之

醉里挑灯看剑，梦回吹角连营。八百里分麾下炙，五十弦翻塞外声，沙场秋点兵。

马作的卢飞快，弓如霹雳弦惊。了却君王天下事，赢得生前身后名。可怜白发生！''')

